CommunityGD32Cores/GD32Firmware/GD32L23x/GD32L23x_standard_peripheral/Include/gd32l23x_adc.h
/*!
    \file    gd32l23x_adc.h
    \brief   definitions for the ADC

    \version 2021-08-04, V1.0.0, firmware for GD32L23x
*/

/*
    Copyright (c) 2021, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32L23X_ADC_H
#define GD32L23X_ADC_H

#include "gd32l23x.h"

/* ADC definitions */
#define ADC                             ADC_BASE

/* registers definitions */
#define ADC_STAT                        REG32(ADC + 0x00000000U)                    /*!< ADC status register */
#define ADC_CTL0                        REG32(ADC + 0x00000004U)                    /*!< ADC control register 0 */
#define ADC_CTL1                        REG32(ADC + 0x00000008U)                    /*!< ADC control register 1 */
#define ADC_SAMPT0                      REG32(ADC + 0x0000000CU)                    /*!< ADC sample time register 0 */
#define ADC_SAMPT1                      REG32(ADC + 0x00000010U)                    /*!< ADC sample time register 1 */
#define ADC_IOFF0                       REG32(ADC + 0x00000014U)                    /*!< ADC inserted channel data offset register 0 */
#define ADC_IOFF1                       REG32(ADC + 0x00000018U)                    /*!< ADC inserted channel data offset register 1 */
#define ADC_IOFF2                       REG32(ADC + 0x0000001CU)                    /*!< ADC inserted channel data offset register 2 */
#define ADC_IOFF3                       REG32(ADC + 0x00000020U)                    /*!< ADC inserted channel data offset register 3 */
#define ADC_WDHT                        REG32(ADC + 0x00000024U)                    /*!< ADC watchdog high threshold register */
#define ADC_WDLT                        REG32(ADC + 0x00000028U)                    /*!< ADC watchdog low threshold register */
#define ADC_RSQ0                        REG32(ADC + 0x0000002CU)                    /*!< ADC regular sequence register 0 */
#define ADC_RSQ1                        REG32(ADC + 0x00000030U)                    /*!< ADC regular sequence register 1 */
#define ADC_RSQ2                        REG32(ADC + 0x00000034U)                    /*!< ADC regular sequence register 2 */
#define ADC_ISQ                         REG32(ADC + 0x00000038U)                    /*!< ADC inserted sequence register */
#define ADC_IDATA0                      REG32(ADC + 0x0000003CU)                    /*!< ADC inserted data register 0 */
#define ADC_IDATA1                      REG32(ADC + 0x00000040U)                    /*!< ADC inserted data register 1 */
#define ADC_IDATA2                      REG32(ADC + 0x00000044U)                    /*!< ADC inserted data register 2 */
#define ADC_IDATA3                      REG32(ADC + 0x00000048U)                    /*!< ADC inserted data register 3 */
#define ADC_RDATA                       REG32(ADC + 0x0000004CU)                    /*!< ADC regular data register */
#define ADC_OVSAMPCTL                   REG32(ADC + 0x00000080U)                    /*!< ADC oversampling control register */
#define ADC_CCTL                        REG32(ADC + 0x000000C0U)                    /*!< ADC charge control register */

/* bits definitions */
/* ADC_STAT */
#define ADC_STAT_WDE                    BIT(0)                                      /*!< analog watchdog event flag */
#define ADC_STAT_EOC                    BIT(1)                                      /*!< end of conversion */
#define ADC_STAT_EOIC                   BIT(2)                                      /*!< inserted channel end of conversion */
#define ADC_STAT_STIC                   BIT(3)                                      /*!< inserted channel start flag */
#define ADC_STAT_STRC                   BIT(4)                                      /*!< regular channel start flag */

/* ADC_CTL0 */
#define ADC_CTL0_WDCHSEL                BITS(0, 4)                                  /*!< analog watchdog channel select bits */
#define ADC_CTL0_EOCIE                  BIT(5)                                      /*!< interrupt enable for EOC */
#define ADC_CTL0_WDEIE                  BIT(6)                                      /*!< analog watchdog interrupt enable */
#define ADC_CTL0_EOICIE                 BIT(7)                                      /*!< interrupt enable for inserted channels */
#define ADC_CTL0_SM                     BIT(8)                                      /*!< scan mode */
#define ADC_CTL0_WDSC                   BIT(9)                                      /*!< when in scan mode, analog watchdog is effective on a single channel */
#define ADC_CTL0_ICA                    BIT(10)                                     /*!< automatic inserted group conversion */
#define ADC_CTL0_DISRC                  BIT(11)                                     /*!< discontinuous mode on regular channels */
#define ADC_CTL0_DISIC                  BIT(12)                                     /*!< discontinuous mode on inserted channels */
#define ADC_CTL0_DISNUM                 BITS(13, 15)                                /*!< discontinuous mode channel count */
#define ADC_CTL0_IWDEN                  BIT(22)                                     /*!< analog watchdog enable on inserted channels */
#define ADC_CTL0_RWDEN                  BIT(23)                                     /*!< analog watchdog enable on regular channels */
#define ADC_CTL0_DRES                   BITS(24, 25)                                /*!< ADC resolution */

/* ADC_CTL1 */
#define ADC_CTL1_ADCON                  BIT(0)                                      /*!< ADC converter on */
#define ADC_CTL1_CTN                    BIT(1)                                      /*!< continuous mode */
#define ADC_CTL1_CLB                    BIT(2)                                      /*!< ADC calibration */
#define ADC_CTL1_RSTCLB                 BIT(3)                                      /*!< reset calibration */
#define ADC_CTL1_DMA                    BIT(8)                                      /*!< dma request enable */
#define ADC_CTL1_DAL                    BIT(11)                                     /*!< data alignment */
#define ADC_CTL1_ETSIC                  BITS(12, 14)                                /*!< external trigger select for inserted channel */
#define ADC_CTL1_ETEIC                  BIT(15)                                     /*!< external trigger enable for inserted channel */
#define ADC_CTL1_ETSRC                  BITS(17, 19)                                /*!< external trigger select for regular channel */
#define ADC_CTL1_ETERC                  BIT(20)                                     /*!< external trigger enable for regular channel */
#define ADC_CTL1_SWICST                 BIT(21)                                     /*!< start on inserted channels */
#define ADC_CTL1_SWRCST                 BIT(22)                                     /*!< start on regular channels */
#define ADC_CTL1_TSVEN                  BIT(23)                                     /*!< channel 16(temperature sensor)enable of ADC */
#define ADC_CTL1_INREFEN                BIT(24)                                     /*!< channel 17(internal reference voltage)enable of ADC */
#define ADC_CTL1_VBATEN                 BIT(25)                                     /*!< channel 18(1/3 voltage of external battery)enable of ADC */
#define ADC_CTL1_VSLCDEN                BIT(26)                                     /*!< channel 19(1/3 voltage of VSLCD)enable of ADC */

/* ADC_SAMPTx x=0..1 */
#define ADC_SAMPTX_SPTN                 BITS(0, 2)                                  /*!< channel n(n=0..19) sampling time selection */

