CommunityGD32Cores/GD32Firmware/GD32L23x/GD32L23x_standard_peripheral/Include/gd32l23x_adc.h
/* ADC_IOFFx x=0..3 */
#define ADC_IOFFX_IOFF                  BITS(0, 11)                                 /*!< data offset for inserted channel x */

/* ADC_WDHT */
#define ADC_WDHT_WDHT                   BITS(0, 11)                                 /*!< analog watchdog high threshold */

/* ADC_WDLT */
#define ADC_WDLT_WDLT                   BITS(0, 11)                                 /*!< analog watchdog low threshold */

/* ADC_RSQx */
#define ADC_RSQX_RSQN                   BITS(0, 4)                                  /*!< x(x = 0..15) conversion in regular sequence */
#define ADC_RSQ0_RL                     BITS(20, 23)                                /*!< regular channel sequence length */

/* ADC_ISQ */
#define ADC_ISQ_ISQN                    BITS(0, 4)                                  /*!< x conversion in inserted sequence */
#define ADC_ISQ_IL                      BITS(20, 21)                                /*!< inserted sequence length */

/* ADC_IDATAx x=0..3*/
#define ADC_IDATAX_IDATAN               BITS(0, 15)                                 /*!< inserted channel x conversion data */

/* ADC_RDATA */
#define ADC_RDATA_RDATA                 BITS(0, 15)                                 /*!< regular channel data */

/* ADC_OVSAMPCTL */
#define ADC_OVSAMPCTL_OVSEN             BIT(0)                                      /*!< oversampling enable */
#define ADC_OVSAMPCTL_OVSR              BITS(2, 4)                                  /*!< oversampling ratio */
#define ADC_OVSAMPCTL_OVSS              BITS(5, 8)                                  /*!< oversampling shift */
#define ADC_OVSAMPCTL_TOVS              BIT(9)                                      /*!< triggered oversampling */

/* ADC_CCTL */
#define ADC_CCTL_CCNT                   BITS(0, 11)                                 /*!< ADC charge pulse width counter */
#define ADC_CCTL_CHARGE                 BIT(16)                                     /*!< ADC charge status */

/* constants definitions */
/* ADC flag definitions */
#define ADC_FLAG_WDE                    ADC_STAT_WDE                                /*!< analog watchdog event flag */
#define ADC_FLAG_EOC                    ADC_STAT_EOC                                /*!< end of conversion */
#define ADC_FLAG_EOIC                   ADC_STAT_EOIC                               /*!< inserted channel end of conversion */
#define ADC_FLAG_STIC                   ADC_STAT_STIC                               /*!< inserted channel start flag */
#define ADC_FLAG_STRC                   ADC_STAT_STRC                               /*!< regular channel start flag */
#define ADC_FLAG_CHARGE                 ADC_CCTL_CHARGE                             /*!< ADC charge flag */

/* ADC_CTL0 register value */
#define CTL0_DISNUM(regval)             (BITS(13, 15) & ((uint32_t)(regval) << 13)) /*!< write value to ADC_CTL0_DISNUM bit field */

/* ADC special function definitions */
#define ADC_SCAN_MODE                   ADC_CTL0_SM                                 /*!< scan mode */
#define ADC_INSERTED_CHANNEL_AUTO       ADC_CTL0_ICA                                /*!< inserted channel group convert automatically */
#define ADC_CONTINUOUS_MODE             ADC_CTL1_CTN                                /*!< continuous mode */

/* temperature sensor channel, internal reference voltage channel, VBAT channel and VSLCD channel */
#define ADC_TEMP_CHANNEL_SWITCH         ADC_CTL1_TSVEN                              /*!< temperature channel */
#define ADC_INTERNAL_CHANNEL_SWITCH     ADC_CTL1_INREFEN                            /*!< internal Vref channel */
#define ADC_VBAT_CHANNEL_SWITCH         ADC_CTL1_VBATEN                             /*!< VBAT channel */
#define ADC_VSLCD_CHANNEL_SWITCH        ADC_CTL1_VSLCDEN                            /*!< VSLCD channel */

/* ADC data alignment */
#define ADC_DATAALIGN_RIGHT             ((uint32_t)0x00000000U)                     /*!< LSB alignment */
#define ADC_DATAALIGN_LEFT              ADC_CTL1_DAL                                /*!< MSB alignment */

/* ADC external trigger select for regular channel */
#define CTL1_ETSRC(regval)              (BITS(17, 19) & ((uint32_t)(regval) << 17))
#define ADC_EXTTRIG_REGULAR_T8_CH0      CTL1_ETSRC(0)                               /*!< TIMER8 CH0 event select */
#define ADC_EXTTRIG_REGULAR_T8_CH1      CTL1_ETSRC(1)                               /*!< TIMER8 CH1 event select */
#define ADC_EXTTRIG_REGULAR_T1_CH1      CTL1_ETSRC(3)                               /*!< TIMER1 CH1 event select */
#define ADC_EXTTRIG_REGULAR_T2_TRGO     CTL1_ETSRC(4)                               /*!< TIMER2 TRGO event select */
#define ADC_EXTTRIG_REGULAR_T11_CH0     CTL1_ETSRC(5)                               /*!< TIMER11 CH0 event select */
#define ADC_EXTTRIG_REGULAR_EXTI_11     CTL1_ETSRC(6)                               /*!< external interrupt line 11 select  */
#define ADC_EXTTRIG_REGULAR_NONE        CTL1_ETSRC(7)                               /*!< software trigger select  */

/* ADC external trigger select for inserted channel */
#define CTL1_ETSIC(regval)              (BITS(12, 14) & ((uint32_t)(regval) << 12))
#define ADC_EXTTRIG_INSERTED_T1_TRGO    CTL1_ETSIC(2)                               /*!< TIMER1 TRGO event select */
#define ADC_EXTTRIG_INSERTED_T1_CH0     CTL1_ETSIC(3)                               /*!< TIMER1 CH0 event select */
#define ADC_EXTTRIG_INSERTED_T2_CH3     CTL1_ETSIC(4)                               /*!< TIMER2 CH3 event select */
#define ADC_EXTTRIG_INSERTED_EXTI_15    CTL1_ETSIC(6)                               /*!< external interrupt line 15 */
#define ADC_EXTTRIG_INSERTED_NONE       CTL1_ETSIC(7)                               /*!< software trigger select */

/* ADC channel sample time */
#define SAMPTX_SPT(regval)              (BITS(0, 2) & ((uint32_t)(regval) << 0))    /*!< write value to ADC_SAMPTX_SPT bit field */
#define ADC_SAMPLETIME_2POINT5          SAMPTX_SPT(0)                               /*!< 2.5 sampling cycles */
#define ADC_SAMPLETIME_7POINT5          SAMPTX_SPT(1)                               /*!< 7.5 sampling cycles */
#define ADC_SAMPLETIME_13POINT5         SAMPTX_SPT(2)                               /*!< 13.5 sampling cycles */
#define ADC_SAMPLETIME_28POINT5         SAMPTX_SPT(3)                               /*!< 28.5 sampling cycles */
#define ADC_SAMPLETIME_41POINT5         SAMPTX_SPT(4)                               /*!< 41.5 sampling cycles */
#define ADC_SAMPLETIME_55POINT5         SAMPTX_SPT(5)                               /*!< 55.5 sampling cycles */
#define ADC_SAMPLETIME_71POINT5         SAMPTX_SPT(6)                               /*!< 71.5 sampling cycles */
#define ADC_SAMPLETIME_239POINT5        SAMPTX_SPT(7)                               /*!< 239.5 sampling cycles */

/* ADC_IOFFX register value */
#define IOFFX_IOFF(regval)              (BITS(0, 11) & ((uint32_t)(regval) << 0))   /*!< write value to ADC_IOFFX_IOFF bit field */

/* ADC_WDHT register value */
#define WDHT_WDHT(regval)               (BITS(0, 11) & ((uint32_t)(regval) << 0))   /*!< write value to ADC_WDHT_WDHT bit field */

